app/controllers/outcomes_controller.rb

  def index
    @outcomes = Outcome.all
---
SELECT * FROM "outcomes"

  def show
    @outcome = Outcome.find(params[:id])
---
SELECT * FROM "outcomes" WHERE ("outcomes"."id" = 1)

  def create
    @outcome = Outcome.new(params[:outcome])
    if @outcome.save
---
INSERT INTO "outcomes" ("created_at", "updated_at", "points", "value", "description") VALUES('2010-10-24 14:01:50', '2010-10-24 14:01:50', 0, 'Bad', 'You wake up with a bad head cold. You try to work, but just stare aimlessly at the monitor all day. You go home at lunch and try to sleep it off.')